{
  "format": "layers-model",
  "generatedBy": "keras v3.10.0",
  "convertedBy": "manual conversion v2",
  "modelTopology": {
    "name": "sequential_4",
    "trainable": true,
    "dtype": {
      "module": "keras",
      "class_name": "DTypePolicy",
      "config": {
        "name": "float32"
      },
      "registered_name": null
    },
    "layers": [
      {
        "module": "keras.layers",
        "class_name": "InputLayer",
        "config": {
          "batch_shape": [
            null,
            224,
            224,
            3
          ],
          "dtype": "float32",
          "sparse": false,
          "ragged": false,
          "name": "input_layer_3"
        },
        "registered_name": null
      },
      {
        "module": "keras.src.models.functional",
        "class_name": "Functional",
        "config": {
          "name": "vgg16",
          "trainable": false,
          "layers": [
            {
              "module": "keras.layers",
              "class_name": "InputLayer",
              "config": {
                "batch_shape": [
                  null,
                  224,
                  224,
                  3
                ],
                "dtype": "float32",
                "sparse": false,
                "ragged": false,
                "name": "input_layer_1"
              },
              "registered_name": null,
              "name": "input_layer_1",
              "inbound_nodes": []
            },
            {
              "module": "keras.layers",
              "class_name": "Conv2D",
              "config": {
                "name": "block1_conv1",
                "trainable": false,
                "dtype": {
                  "module": "keras",
                  "class_name": "DTypePolicy",
                  "config": {
                    "name": "float32"
                  },
                  "registered_name": null
                },
                "filters": 64,
                "kernel_size": [
                  3,
                  3
                ],
                "strides": [
                  1,
                  1
                ],
                "padding": "same",
                "data_format": "channels_last",
                "dilation_rate": [
                  1,
                  1
                ],
                "groups": 1,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                  "module": "keras.initializers",
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  },
                  "registered_name": null
                },
                "bias_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Zeros",
                  "config": {},
                  "registered_name": null
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              },
              "registered_name": null,
              "build_config": {
                "input_shape": [
                  null,
                  224,
                  224,
                  3
                ]
              },
              "name": "block1_conv1",
              "inbound_nodes": [
                {
                  "args": [
                    {
                      "class_name": "__keras_tensor__",
                      "config": {
                        "shape": [
                          null,
                          224,
                          224,
                          3
                        ],
                        "dtype": "float32",
                        "keras_history": [
                          "input_layer_1",
                          0,
                          0
                        ]
                      }
                    }
                  ],
                  "kwargs": {}
                }
              ]
            },
            {
              "module": "keras.layers",
              "class_name": "Conv2D",
              "config": {
                "name": "block1_conv2",
                "trainable": false,
                "dtype": {
                  "module": "keras",
                  "class_name": "DTypePolicy",
                  "config": {
                    "name": "float32"
                  },
                  "registered_name": null
                },
                "filters": 64,
                "kernel_size": [
                  3,
                  3
                ],
                "strides": [
                  1,
                  1
                ],
                "padding": "same",
                "data_format": "channels_last",
                "dilation_rate": [
                  1,
                  1
                ],
                "groups": 1,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                  "module": "keras.initializers",
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  },
                  "registered_name": null
                },
                "bias_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Zeros",
                  "config": {},
                  "registered_name": null
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              },
              "registered_name": null,
              "build_config": {
                "input_shape": [
                  null,
                  224,
                  224,
                  64
                ]
              },
              "name": "block1_conv2",
              "inbound_nodes": [
                {
                  "args": [
                    {
                      "class_name": "__keras_tensor__",
                      "config": {
                        "shape": [
                          null,
                          224,
                          224,
                          64
                        ],
                        "dtype": "float32",
                        "keras_history": [
                          "block1_conv1",
                          0,
                          0
                        ]
                      }
                    }
                  ],
                  "kwargs": {}
                }
              ]
            },
            {
              "module": "keras.layers",
              "class_name": "MaxPooling2D",
              "config": {
                "name": "block1_pool",
                "trainable": false,
                "dtype": {
                  "module": "keras",
                  "class_name": "DTypePolicy",
                  "config": {
                    "name": "float32"
                  },
                  "registered_name": null
                },
                "pool_size": [
                  2,
                  2
                ],
                "padding": "valid",
                "strides": [
                  2,
                  2
                ],
                "data_format": "channels_last"
              },
              "registered_name": null,
              "name": "block1_pool",
              "inbound_nodes": [
                {
                  "args": [
                    {
                      "class_name": "__keras_tensor__",
                      "config": {
                        "shape": [
                          null,
                          224,
                          224,
                          64
                        ],
                        "dtype": "float32",
                        "keras_history": [
                          "block1_conv2",
                          0,
                          0
                        ]
                      }
                    }
                  ],
                  "kwargs": {}
                }
              ]
            },
            {
              "module": "keras.layers",
              "class_name": "Conv2D",
              "config": {
                "name": "block2_conv1",
                "trainable": false,
                "dtype": {
                  "module": "keras",
                  "class_name": "DTypePolicy",
                  "config": {
                    "name": "float32"
                  },
                  "registered_name": null
                },
                "filters": 128,
                "kernel_size": [
                  3,
                  3
                ],
                "strides": [
                  1,
                  1
                ],
                "padding": "same",
                "data_format": "channels_last",
                "dilation_rate": [
                  1,
                  1
                ],
                "groups": 1,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                  "module": "keras.initializers",
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  },
                  "registered_name": null
                },
                "bias_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Zeros",
                  "config": {},
                  "registered_name": null
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              },
              "registered_name": null,
              "build_config": {
                "input_shape": [
                  null,
                  112,
                  112,
                  64
                ]
              },
              "name": "block2_conv1",
              "inbound_nodes": [
                {
                  "args": [
                    {
                      "class_name": "__keras_tensor__",
                      "config": {
                        "shape": [
                          null,
                          112,
                          112,
                          64
                        ],
                        "dtype": "float32",
                        "keras_history": [
                          "block1_pool",
                          0,
                          0
                        ]
                      }
                    }
                  ],
                  "kwargs": {}
                }
              ]
            },
            {
              "module": "keras.layers",
              "class_name": "Conv2D",
              "config": {
                "name": "block2_conv2",
                "trainable": false,
                "dtype": {
                  "module": "keras",
                  "class_name": "DTypePolicy",
                  "config": {
                    "name": "float32"
                  },
                  "registered_name": null
                },
                "filters": 128,
                "kernel_size": [
                  3,
                  3
                ],
                "strides": [
                  1,
                  1
                ],
                "padding": "same",
                "data_format": "channels_last",
                "dilation_rate": [
                  1,
                  1
                ],
                "groups": 1,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                  "module": "keras.initializers",
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  },
                  "registered_name": null
                },
                "bias_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Zeros",
                  "config": {},
                  "registered_name": null
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              },
              "registered_name": null,
              "build_config": {
                "input_shape": [
                  null,
                  112,
                  112,
                  128
                ]
              },
              "name": "block2_conv2",
              "inbound_nodes": [
                {
                  "args": [
                    {
                      "class_name": "__keras_tensor__",
                      "config": {
                        "shape": [
                          null,
                          112,
                          112,
                          128
                        ],
                        "dtype": "float32",
                        "keras_history": [
                          "block2_conv1",
                          0,
                          0
                        ]
                      }
                    }
                  ],
                  "kwargs": {}
                }
              ]
            },
            {
              "module": "keras.layers",
              "class_name": "MaxPooling2D",
              "config": {
                "name": "block2_pool",
                "trainable": false,
                "dtype": {
                  "module": "keras",
                  "class_name": "DTypePolicy",
                  "config": {
                    "name": "float32"
                  },
                  "registered_name": null
                },
                "pool_size": [
                  2,
                  2
                ],
                "padding": "valid",
                "strides": [
                  2,
                  2
                ],
                "data_format": "channels_last"
              },
              "registered_name": null,
              "name": "block2_pool",
              "inbound_nodes": [
                {
                  "args": [
                    {
                      "class_name": "__keras_tensor__",
                      "config": {
                        "shape": [
                          null,
                          112,
                          112,
                          128
                        ],
                        "dtype": "float32",
                        "keras_history": [
                          "block2_conv2",
                          0,
                          0
                        ]
                      }
                    }
                  ],
                  "kwargs": {}
                }
              ]
            },
            {
              "module": "keras.layers",
              "class_name": "Conv2D",
              "config": {
                "name": "block3_conv1",
                "trainable": false,
                "dtype": {
                  "module": "keras",
                  "class_name": "DTypePolicy",
                  "config": {
                    "name": "float32"
                  },
                  "registered_name": null
                },
                "filters": 256,
                "kernel_size": [
                  3,
                  3
                ],
                "strides": [
                  1,
                  1
                ],
                "padding": "same",
                "data_format": "channels_last",
                "dilation_rate": [
                  1,
                  1
                ],
                "groups": 1,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                  "module": "keras.initializers",
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  },
                  "registered_name": null
                },
                "bias_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Zeros",
                  "config": {},
                  "registered_name": null
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              },
              "registered_name": null,
              "build_config": {
                "input_shape": [
                  null,
                  56,
                  56,
                  128
                ]
              },
              "name": "block3_conv1",
              "inbound_nodes": [
                {
                  "args": [
                    {
                      "class_name": "__keras_tensor__",
                      "config": {
                        "shape": [
                          null,
                          56,
                          56,
                          128
                        ],
                        "dtype": "float32",
                        "keras_history": [
                          "block2_pool",
                          0,
                          0
                        ]
                      }
                    }
                  ],
                  "kwargs": {}
                }
              ]
            },
            {
              "module": "keras.layers",
              "class_name": "Conv2D",
              "config": {
                "name": "block3_conv2",
                "trainable": false,
                "dtype": {
                  "module": "keras",
                  "class_name": "DTypePolicy",
                  "config": {
                    "name": "float32"
                  },
                  "registered_name": null
                },
                "filters": 256,
                "kernel_size": [
                  3,
                  3
                ],
                "strides": [
                  1,
                  1
                ],
                "padding": "same",
                "data_format": "channels_last",
                "dilation_rate": [
                  1,
                  1
                ],
                "groups": 1,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                  "module": "keras.initializers",
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  },
                  "registered_name": null
                },
                "bias_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Zeros",
                  "config": {},
                  "registered_name": null
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              },
              "registered_name": null,
              "build_config": {
                "input_shape": [
                  null,
                  56,
                  56,
                  256
                ]
              },
              "name": "block3_conv2",
              "inbound_nodes": [
                {
                  "args": [
                    {
                      "class_name": "__keras_tensor__",
                      "config": {
                        "shape": [
                          null,
                          56,
                          56,
                          256
                        ],
                        "dtype": "float32",
                        "keras_history": [
                          "block3_conv1",
                          0,
                          0
                        ]
                      }
                    }
                  ],
                  "kwargs": {}
                }
              ]
            },
            {
              "module": "keras.layers",
              "class_name": "Conv2D",
              "config": {
                "name": "block3_conv3",
                "trainable": false,
                "dtype": {
                  "module": "keras",
                  "class_name": "DTypePolicy",
                  "config": {
                    "name": "float32"
                  },
                  "registered_name": null
                },
                "filters": 256,
                "kernel_size": [
                  3,
                  3
                ],
                "strides": [
                  1,
                  1
                ],
                "padding": "same",
                "data_format": "channels_last",
                "dilation_rate": [
                  1,
                  1
                ],
                "groups": 1,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                  "module": "keras.initializers",
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  },
                  "registered_name": null
                },
                "bias_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Zeros",
                  "config": {},
                  "registered_name": null
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              },
              "registered_name": null,
              "build_config": {
                "input_shape": [
                  null,
                  56,
                  56,
                  256
                ]
              },
              "name": "block3_conv3",
              "inbound_nodes": [
                {
                  "args": [
                    {
                      "class_name": "__keras_tensor__",
                      "config": {
                        "shape": [
                          null,
                          56,
                          56,
                          256
                        ],
                        "dtype": "float32",
                        "keras_history": [
                          "block3_conv2",
                          0,
                          0
                        ]
                      }
                    }
                  ],
                  "kwargs": {}
                }
              ]
            },
            {
              "module": "keras.layers",
              "class_name": "MaxPooling2D",
              "config": {
                "name": "block3_pool",
                "trainable": false,
                "dtype": {
                  "module": "keras",
                  "class_name": "DTypePolicy",
                  "config": {
                    "name": "float32"
                  },
                  "registered_name": null
                },
                "pool_size": [
                  2,
                  2
                ],
                "padding": "valid",
                "strides": [
                  2,
                  2
                ],
                "data_format": "channels_last"
              },
              "registered_name": null,
              "name": "block3_pool",
              "inbound_nodes": [
                {
                  "args": [
                    {
                      "class_name": "__keras_tensor__",
                      "config": {
                        "shape": [
                          null,
                          56,
                          56,
                          256
                        ],
                        "dtype": "float32",
                        "keras_history": [
                          "block3_conv3",
                          0,
                          0
                        ]
                      }
                    }
                  ],
                  "kwargs": {}
                }
              ]
            },
            {
              "module": "keras.layers",
              "class_name": "Conv2D",
              "config": {
                "name": "block4_conv1",
                "trainable": false,
                "dtype": {
                  "module": "keras",
                  "class_name": "DTypePolicy",
                  "config": {
                    "name": "float32"
                  },
                  "registered_name": null
                },
                "filters": 512,
                "kernel_size": [
                  3,
                  3
                ],
                "strides": [
                  1,
                  1
                ],
                "padding": "same",
                "data_format": "channels_last",
                "dilation_rate": [
                  1,
                  1
                ],
                "groups": 1,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                  "module": "keras.initializers",
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  },
                  "registered_name": null
                },
                "bias_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Zeros",
                  "config": {},
                  "registered_name": null
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              },
              "registered_name": null,
              "build_config": {
                "input_shape": [
                  null,
                  28,
                  28,
                  256
                ]
              },
              "name": "block4_conv1",
              "inbound_nodes": [
                {
                  "args": [
                    {
                      "class_name": "__keras_tensor__",
                      "config": {
                        "shape": [
                          null,
                          28,
                          28,
                          256
                        ],
                        "dtype": "float32",
                        "keras_history": [
                          "block3_pool",
                          0,
                          0
                        ]
                      }
                    }
                  ],
                  "kwargs": {}
                }
              ]
            },
            {
              "module": "keras.layers",
              "class_name": "Conv2D",
              "config": {
                "name": "block4_conv2",
                "trainable": false,
                "dtype": {
                  "module": "keras",
                  "class_name": "DTypePolicy",
                  "config": {
                    "name": "float32"
                  },
                  "registered_name": null
                },
                "filters": 512,
                "kernel_size": [
                  3,
                  3
                ],
                "strides": [
                  1,
                  1
                ],
                "padding": "same",
                "data_format": "channels_last",
                "dilation_rate": [
                  1,
                  1
                ],
                "groups": 1,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                  "module": "keras.initializers",
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  },
                  "registered_name": null
                },
                "bias_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Zeros",
                  "config": {},
                  "registered_name": null
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              },
              "registered_name": null,
              "build_config": {
                "input_shape": [
                  null,
                  28,
                  28,
                  512
                ]
              },
              "name": "block4_conv2",
              "inbound_nodes": [
                {
                  "args": [
                    {
                      "class_name": "__keras_tensor__",
                      "config": {
                        "shape": [
                          null,
                          28,
                          28,
                          512
                        ],
                        "dtype": "float32",
                        "keras_history": [
                          "block4_conv1",
                          0,
                          0
                        ]
                      }
                    }
                  ],
                  "kwargs": {}
                }
              ]
            },
            {
              "module": "keras.layers",
              "class_name": "Conv2D",
              "config": {
                "name": "block4_conv3",
                "trainable": false,
                "dtype": {
                  "module": "keras",
                  "class_name": "DTypePolicy",
                  "config": {
                    "name": "float32"
                  },
                  "registered_name": null
                },
                "filters": 512,
                "kernel_size": [
                  3,
                  3
                ],
                "strides": [
                  1,
                  1
                ],
                "padding": "same",
                "data_format": "channels_last",
                "dilation_rate": [
                  1,
                  1
                ],
                "groups": 1,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                  "module": "keras.initializers",
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  },
                  "registered_name": null
                },
                "bias_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Zeros",
                  "config": {},
                  "registered_name": null
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              },
              "registered_name": null,
              "build_config": {
                "input_shape": [
                  null,
                  28,
                  28,
                  512
                ]
              },
              "name": "block4_conv3",
              "inbound_nodes": [
                {
                  "args": [
                    {
                      "class_name": "__keras_tensor__",
                      "config": {
                        "shape": [
                          null,
                          28,
                          28,
                          512
                        ],
                        "dtype": "float32",
                        "keras_history": [
                          "block4_conv2",
                          0,
                          0
                        ]
                      }
                    }
                  ],
                  "kwargs": {}
                }
              ]
            },
            {
              "module": "keras.layers",
              "class_name": "MaxPooling2D",
              "config": {
                "name": "block4_pool",
                "trainable": false,
                "dtype": {
                  "module": "keras",
                  "class_name": "DTypePolicy",
                  "config": {
                    "name": "float32"
                  },
                  "registered_name": null
                },
                "pool_size": [
                  2,
                  2
                ],
                "padding": "valid",
                "strides": [
                  2,
                  2
                ],
                "data_format": "channels_last"
              },
              "registered_name": null,
              "name": "block4_pool",
              "inbound_nodes": [
                {
                  "args": [
                    {
                      "class_name": "__keras_tensor__",
                      "config": {
                        "shape": [
                          null,
                          28,
                          28,
                          512
                        ],
                        "dtype": "float32",
                        "keras_history": [
                          "block4_conv3",
                          0,
                          0
                        ]
                      }
                    }
                  ],
                  "kwargs": {}
                }
              ]
            },
            {
              "module": "keras.layers",
              "class_name": "Conv2D",
              "config": {
                "name": "block5_conv1",
                "trainable": false,
                "dtype": {
                  "module": "keras",
                  "class_name": "DTypePolicy",
                  "config": {
                    "name": "float32"
                  },
                  "registered_name": null
                },
                "filters": 512,
                "kernel_size": [
                  3,
                  3
                ],
                "strides": [
                  1,
                  1
                ],
                "padding": "same",
                "data_format": "channels_last",
                "dilation_rate": [
                  1,
                  1
                ],
                "groups": 1,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                  "module": "keras.initializers",
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  },
                  "registered_name": null
                },
                "bias_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Zeros",
                  "config": {},
                  "registered_name": null
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              },
              "registered_name": null,
              "build_config": {
                "input_shape": [
                  null,
                  14,
                  14,
                  512
                ]
              },
              "name": "block5_conv1",
              "inbound_nodes": [
                {
                  "args": [
                    {
                      "class_name": "__keras_tensor__",
                      "config": {
                        "shape": [
                          null,
                          14,
                          14,
                          512
                        ],
                        "dtype": "float32",
                        "keras_history": [
                          "block4_pool",
                          0,
                          0
                        ]
                      }
                    }
                  ],
                  "kwargs": {}
                }
              ]
            },
            {
              "module": "keras.layers",
              "class_name": "Conv2D",
              "config": {
                "name": "block5_conv2",
                "trainable": false,
                "dtype": {
                  "module": "keras",
                  "class_name": "DTypePolicy",
                  "config": {
                    "name": "float32"
                  },
                  "registered_name": null
                },
                "filters": 512,
                "kernel_size": [
                  3,
                  3
                ],
                "strides": [
                  1,
                  1
                ],
                "padding": "same",
                "data_format": "channels_last",
                "dilation_rate": [
                  1,
                  1
                ],
                "groups": 1,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                  "module": "keras.initializers",
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  },
                  "registered_name": null
                },
                "bias_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Zeros",
                  "config": {},
                  "registered_name": null
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              },
              "registered_name": null,
              "build_config": {
                "input_shape": [
                  null,
                  14,
                  14,
                  512
                ]
              },
              "name": "block5_conv2",
              "inbound_nodes": [
                {
                  "args": [
                    {
                      "class_name": "__keras_tensor__",
                      "config": {
                        "shape": [
                          null,
                          14,
                          14,
                          512
                        ],
                        "dtype": "float32",
                        "keras_history": [
                          "block5_conv1",
                          0,
                          0
                        ]
                      }
                    }
                  ],
                  "kwargs": {}
                }
              ]
            },
            {
              "module": "keras.layers",
              "class_name": "Conv2D",
              "config": {
                "name": "block5_conv3",
                "trainable": false,
                "dtype": {
                  "module": "keras",
                  "class_name": "DTypePolicy",
                  "config": {
                    "name": "float32"
                  },
                  "registered_name": null
                },
                "filters": 512,
                "kernel_size": [
                  3,
                  3
                ],
                "strides": [
                  1,
                  1
                ],
                "padding": "same",
                "data_format": "channels_last",
                "dilation_rate": [
                  1,
                  1
                ],
                "groups": 1,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                  "module": "keras.initializers",
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  },
                  "registered_name": null
                },
                "bias_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Zeros",
                  "config": {},
                  "registered_name": null
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              },
              "registered_name": null,
              "build_config": {
                "input_shape": [
                  null,
                  14,
                  14,
                  512
                ]
              },
              "name": "block5_conv3",
              "inbound_nodes": [
                {
                  "args": [
                    {
                      "class_name": "__keras_tensor__",
                      "config": {
                        "shape": [
                          null,
                          14,
                          14,
                          512
                        ],
                        "dtype": "float32",
                        "keras_history": [
                          "block5_conv2",
                          0,
                          0
                        ]
                      }
                    }
                  ],
                  "kwargs": {}
                }
              ]
            },
            {
              "module": "keras.layers",
              "class_name": "MaxPooling2D",
              "config": {
                "name": "block5_pool",
                "trainable": false,
                "dtype": {
                  "module": "keras",
                  "class_name": "DTypePolicy",
                  "config": {
                    "name": "float32"
                  },
                  "registered_name": null
                },
                "pool_size": [
                  2,
                  2
                ],
                "padding": "valid",
                "strides": [
                  2,
                  2
                ],
                "data_format": "channels_last"
              },
              "registered_name": null,
              "name": "block5_pool",
              "inbound_nodes": [
                {
                  "args": [
                    {
                      "class_name": "__keras_tensor__",
                      "config": {
                        "shape": [
                          null,
                          14,
                          14,
                          512
                        ],
                        "dtype": "float32",
                        "keras_history": [
                          "block5_conv3",
                          0,
                          0
                        ]
                      }
                    }
                  ],
                  "kwargs": {}
                }
              ]
            }
          ],
          "input_layers": [
            [
              "input_layer_1",
              0,
              0
            ]
          ],
          "output_layers": [
            [
              "block5_pool",
              0,
              0
            ]
          ]
        },
        "registered_name": "Functional",
        "build_config": {
          "input_shape": null
        },
        "compile_config": {}
      },
      {
        "module": "keras.layers",
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_8",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          },
          "filters": 32,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "groups": 1,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            null,
            7,
            7,
            512
          ]
        }
      },
      {
        "module": "keras.layers",
        "class_name": "MaxPooling2D",
        "config": {
          "name": "max_pooling2d_4",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          },
          "pool_size": [
            2,
            2
          ],
          "padding": "valid",
          "strides": [
            2,
            2
          ],
          "data_format": "channels_last"
        },
        "registered_name": null
      },
      {
        "module": "keras.layers",
        "class_name": "Dropout",
        "config": {
          "name": "dropout_4",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          },
          "rate": 0.5,
          "seed": null,
          "noise_shape": null
        },
        "registered_name": null
      },
      {
        "module": "keras.layers",
        "class_name": "Flatten",
        "config": {
          "name": "flatten_4",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          },
          "data_format": "channels_last"
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            null,
            3,
            3,
            32
          ]
        }
      },
      {
        "module": "keras.layers",
        "class_name": "Dense",
        "config": {
          "name": "dense_4",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          },
          "units": 17,
          "activation": "softmax",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            null,
            288
          ]
        }
      }
    ],
    "build_input_shape": [
      null,
      224,
      224,
      3
    ]
  },
  "weightsManifest": [
    {
      "paths": [
        "weights.bin"
      ],
      "weights": [
        {
          "name": "vgg16/kernel",
          "shape": [
            3,
            3,
            3,
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "vgg16/bias",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "vgg16/weight_2",
          "shape": [
            3,
            3,
            64,
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "vgg16/weight_3",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "vgg16/weight_4",
          "shape": [
            3,
            3,
            64,
            128
